// Задача 25: Напишите программу, которая принимает на вход два числа (A и B) и возводит число 
// А в натуральную степень B (Math.Pow НЕ использовать)
// 3, 5 -> 243 (3⁵)
// 0, 0 - >1
// 2, 4 -> 16

// int NumberToThePower(int x, int n)
// {
//     int power = 1;
//     for (int i = 0; i < n; i++)
//     {
//         power *= x;
//     }
//     return power;
// }

// System.Console.WriteLine("Pls, Input the integer number you want to raise to a power:");
// int num = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Input the integer power:");
// int power = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("your result is " + NumberToThePower(num,power)+", Soooo....What will you do with that information?"); 



// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

// Задача 29: Напишите программу, которая создает массив заданного пользователем размера, 
//заполняет массив элементами от 1 до 99 и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

// 6, 1, 33 -> [6, 1, 33]